src/cf/src/InformationRegisters/ПользовательскиеМакетыПечати/ПользовательскиеМакетыПечати.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПользовательскиеМакетыПечати</name>
  <comment>Макеты печатных форм, изменённые пользователем; при включённом использовании подменяют поставляемые</comment>
  <resources>
    <name>Макет</name>
    <comment>Табличный документ, изменённый пользователем</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Использование</name>
    <comment>Печатать по изменённому макету; иначе используется поставляемый</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВерсияКонфигурации</name>
    <comment>Версия конфигурации на момент правки макета: если она младше текущей, поставляемый макет мог измениться</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <comment>Владелец макета: полное имя объекта метаданных («Документ.РеализацияТоваровУслуг») или «ОбщийМакет»</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяМакета</name>
    <comment>Имя макета в метаданных владельца</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ПользовательскиеМакетыПечати/Forms/МакетыПечатныхФорм/Module.bsl
// Имена колонок содержат букву "ё" (Изменён), как принято в метаданных maERP.
// BSLLS:YoLetterUsage-off

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьМакеты();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьМакет(Команда)

	ТекущиеДанные = Элементы.Макеты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПараметрыФормы = Новый Структура("ПутьКМакету", ТекущиеДанные.ПутьКМакету);
	ОткрытьФорму("РегистрСведений.ПользовательскиеМакетыПечати.Форма.РедактированиеМакета",
		ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьИзменённый(Команда)

	ПереключитьИспользование(Истина);

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПоставляемый(Команда)

	ПереключитьИспользование(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура УдалитьИзменённый(Команда)

	ТекущиеДанные = Элементы.Макеты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или Не ТекущиеДанные.Изменён Тогда
		Возврат;
	КонецЕсли;

	ТекстВопроса = НСтр("ru = 'Удалить изменённый макет? Печать вернётся к поставляемому макету, отменить нельзя.';
		|fr = 'Supprimer le modèle modifié ? L''impression reviendra au modèle fourni, sans retour possible.';
		|en = 'Delete the changed template? Printing will return to the supplied template, this cannot be undone.';
		|es = '¿Eliminar la plantilla modificada? La impresión volverá a la plantilla suministrada, sin vuelta atrás.'");
	ДополнительныеПараметры = Новый Структура("ПутьКМакету", ТекущиеДанные.ПутьКМакету);
	Оповещение = Новый ОписаниеОповещения("УдалитьИзменённыйЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)

	ЗаполнитьМакеты();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УдалитьИзменённыйЗавершение(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	УдалитьМакетНаСервере(ДополнительныеПараметры.ПутьКМакету);

КонецПроцедуры

&НаКлиенте
Процедура ПереключитьИспользование(Использование)

	ТекущиеДанные = Элементы.Макеты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или Не ТекущиеДанные.Изменён Тогда
		Возврат;
	КонецЕсли;

	УстановитьИспользованиеНаСервере(ТекущиеДанные.ПутьКМакету, Использование);

КонецПроцедуры

&НаСервере
Процедура УстановитьИспользованиеНаСервере(Знач ПутьКМакету, Знач Использование)

	ПечатныеФормы.УстановитьИспользованиеМакета(ПутьКМакету, Использование);
	ЗаполнитьМакеты();

КонецПроцедуры

&НаСервере
Процедура УдалитьМакетНаСервере(Знач ПутьКМакету)

	ПечатныеФормы.УдалитьПользовательскийМакет(ПутьКМакету);
	ЗаполнитьМакеты();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМакеты()

	ЗначениеВРеквизитФормы(ПечатныеФормы.МакетыПечатныхФорм(), "Макеты");

КонецПроцедуры

#КонецОбласти
